<?php
if (function_exists('acf_custom_block_add')) {
  add_action('acf/init', 'acf_custom_block_add');
}
/**
 * Acf_custom_block_add
 */
function acf_custom_block_add()
{
  if (function_exists('acf_register_block_type')) {
    /*
    acf_register_block_type(
      array(
        'name'            => 'link-card', //ブロック名を英数字で入力
        'title'           => __('リンクカード'), //ブロックの名前
        'description'     => __('リンクカードです。'), //ブロックの説明
        'render_template' => 'acf-blocks/acf-block/link-card-block.php', //今回表示させるブロックの詳細情報が書かれているファイルまでのパス
        'category'        => 'formatting', //ブロックをどのカテゴリーに属させるか
        'icon'            => 'admin-comments', //ブロックのアイコンを指定
        'keywords'        => array('リンクカード', 'ブログカード'), //ブロックを検索するときのキーワード
        'enqueue_style'   => get_template_directory_uri() . '/acf-blocks/acf-block-style/acf-block.css', //カスタムブロック用のCSSを書くファイルを指定
        'mode'            => 'auto', //どのエリアにブロック入力欄を表示させるか
      )
    );
    acf_register_block_type(
      array(
        'name'            => 'accordion',
        'title'           => __('アコーディオン'),
        'description'     => __(''),
        'render_template' => 'blocks/acf-block/accordion-block.php',
        'category'        => 'theme',
        'icon'            => '<svg id="layer" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="24" height="24" viewBox="0 0 24 24" enable-background="new 0 0 24 24"><rect y="-292e-7" fill="none" width="24" height="24"/><g><path fill="#bf1012" d="M23 1.4311836H1c-.2763672.0-.5.2236328-.5.5v1.630312c0 .2763672.2236328.5000002.5.5000002h9.3778057L12 5.1808782l1.6221943-1.1193824H23c.2763672.0.5-.2236331.5-.5000002v-1.630312c0-.2763672-.223632800000001-.5-.5-.5z"/><g><g><path fill="#bf1012" d="M23 18.9384365H1c-.27637.0-.5.2236404-.5.5v2.6303806c0 .2763596.22363.5.5.5h22c.2763691.0.5-.2236404.5-.5v-2.6303806c0-.276359500000002-.2236309-.5-.5-.5z"/><g><path fill="#fff" d="M22.141901 20.9696312h-.7721958v.7721977h-.4366875v-.7721977h-.7721958v-.4364986h.7721958v-.7677078h.4366875v.7677078h.7721958v.4364986z"/></g><path fill="#fff" d="M13.0021048 21.2536259H2.5245347c-.2763672.0-.5-.2236328-.5-.5s.2236328-.5.5-.5h10.4775696c.2763672.0.5.2236328.5.5s-.223632400000001.5-.499999500000001.5z"/></g><g><path fill="#bf1012" d="M23 14.3715124H1c-.27637.0-.5.2236404-.5.5v2.6303797c0 .2763596.22363.5.5.5h22c.2763691.0.5-.2236404.5-.5v-2.6303797C23.5 14.5951529 23.2763691 14.3715124 23 14.3715124z"/><g><path fill="#fff" d="M22.141901 16.4027081h-.7721958v.7721958h-.4366875v-.7721958h-.7721958v-.4364996h.7721958v-.7677078h.4366875v.7677078h.7721958V16.4027081z"/></g><path fill="#fff" d="M13.0021048 16.6867027H2.5245347c-.2763672.0-.5-.2236328-.5-.5.0-.2763681.2236328-.500001.5-.500001h10.4775696c.2763672.0.5.2236328.5.500001C13.5021048 16.4630699 13.2784719 16.6867027 13.0021048 16.6867027z"/></g><g><path fill="#bf1012" d="M23 6.3043427v6.6306195H1V6.3043427H23m0-.5H1c-.27637.0-.5.223629-.5.5v6.6306195c0 .27637.22363.5.5.5h22c.2763691.0.5-.22363.5-.5V6.3043427c0-.276371-.2236309-.5-.5-.5z"/><g><path fill="#bf1012" d="M20.9330177 7.8355312h-.7721958V7.3990316h.7721958.4366875.7721958v.4364996h-.7721958H20.9330177z"/></g><path fill="#bf1012" d="M13.0021048 8.1195259H2.5245347c-.2763672.0-.5-.2236328-.5-.5s.2236328-.5.5-.5h10.4775696c.2763672.0.5.2236328.5.5s-.223632400000001.5-.499999500000001.5z"/><path fill="#bf1012" d="M20.7770538 10.1220808H2.5245347c-.2763672.0-.5-.2236328-.5-.5s.2236328-.5.5-.5h18.2525196c.2763672.0.5.2236328.5.5s-.223633299999999.5-.500000499999999.5z"/><path fill="#bf1012" d="M17.0614662 12.1246367H2.5245347c-.2763672.0-.5-.2236328-.5-.5s.2236328-.5.5-.5h14.536932c.2763672.0.5.2236328.5.5s-.223633299999999.5-.500000499999999.5z"/></g></g></g></svg>',
        'keywords'        => array(),
        'supports'        => array(
          'align' => false,
          'mode' => true,
          'jsx' => true
        ),
        'mode'            => 'auto',
      )
    );
*/
  }
}
